//В переменную записываете количество программистов.
// В зависимости от количества программистов необходимо вывести правильно окончание.
// Например: • 2 программиста • 1 программиста • 10 программистов • и т.д.

public class seven {
    public static void main(String[] args) {
        int a = 8;
        if (a <= 1)
            System.out.println(a + " " + "программист");
      else if (a > 1 && a <= 4)
            System.out.println(a + " " + "программиста");
         else
                System.out.println(a + " " + "программистов");
            }
            }



