package homework3;

//Напишите программу вывода всех четных чисел от 2 до 100 включительно

public class Task6 {
    public static void main(String[] args) {
        int a;
        for(a=2;a<=100;a+=2){
            System.out.println(a);
        }
    }
}
